app/controllers/password_resets_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'aroopchandra@gmail.com') LIMIT 1
---
  def create
    @user = User.find_by_email(params[:email])

UPDATE `users` SET `updated_at` = '2009-05-21 06:43:19', `crypted_password` = '908f3f6d842c45de501ca6bc9b95d740f3cba3e930a342057a0b24e0a23b9131a20c359ffb4d5779a546037d972e175343a7e35e11e9028c3feda141910cec48', `perishable_token` = 'SIcMH8k9uSVfATXpFroU', `last_login_at` = '2009-05-21 06:32:18', `current_login_at` = '2009-05-21 06:43:19', `password_salt` = '7lFHy1UkpRk-MDRiRtj0', `login_count` = 3, `persistence_token` = 'aa8ed74e17fea4737ae3cbd445dafcf932798e1b08fe62ab413cbcd13e136f3733868a29e639e10261f036b47093ad01fd10538e5682ca0261be37fdc6e680c7', `last_request_at` = '2009-05-21 06:43:19' WHERE `id` = 1
---
  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save

SELECT * FROM `users` WHERE (perishable_token = 'ty2twf0Xd3DevvC6XV9E' and updated_at > '2009-05-21 06:33:18') LIMIT 1
---
  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])