app/controllers/pinless_numbers_controller.rb

  def new
    @pinless_numbers = current_user.pinless_numbers
    @pinless_numbers << PinlessNumber.new
---
INSERT INTO `pinless_numbers` (`created_at`, `updated_at`, `user_id`, `ani_or_phonenumber`) VALUES('2009-05-22 04:47:13', '2009-05-22 04:47:13', 1, NULL)

  def create
    @pinless_number = current_user.pinless_numbers.new(params[:pinless_number])

    respond_to do |format|
      if @pinless_number.save
---
INSERT INTO `pinless_numbers` (`created_at`, `updated_at`, `user_id`, `description`, `ani_or_phonenumber`) VALUES('2009-05-28 05:13:31', '2009-05-28 05:13:31', 1, 'Mobile', '8584057125')

	def index
		@pinless_numbers = current_user.pinless_numbers
		if (current_user.pinless_numbers.size == 0)
		  @pinless_numbers << current_user.pinless_numbers.new
---
SELECT * FROM `pinless_numbers` WHERE (`pinless_numbers`.user_id = 1)
SELECT count(*) AS count_all FROM `pinless_numbers` WHERE (`pinless_numbers`.user_id = 1)
INSERT INTO `pinless_numbers` (`created_at`, `updated_at`, `user_id`, `ani_or_phonenumber`) VALUES('2009-05-21 05:29:41', '2009-05-21 05:29:41', 1, NULL)

	def update
	  unless (params[:commit] == 'Delete')
	    @pinless_number = PinlessNumber.find(params[:id])

      respond_to do |format|
        if @pinless_number.update_attributes(params[:pinless_number])
          flash[:notice] = 'Pinless dial number was successfully updated.'
          format.html { redirect_to  :action => "index" }
          format.xml  { head :ok }
        else
          format.html { render :action => "index" }
          format.xml  { render :xml => @pinless_number.errors, :status => :unprocessable_entity }
        end
      end
    else
      #Delete
      @pinless_number = PinlessNumber.find(params[:id])
      @pinless_number.destroy
---
SELECT * FROM `pinless_numbers` WHERE (`pinless_numbers`.`id` = 1)
UPDATE `pinless_numbers` SET `updated_at` = '2009-05-22 04:47:06', `ani_or_phonenumber` = '9163077863' WHERE `id` = 1
DELETE FROM `pinless_numbers` WHERE `id` = 7