app/controllers/speeddial_numbers_controller.rb

INSERT INTO `speeddial_numbers` (`number`, `created_at`, `updated_at`, `user_id`, `entry`, `description`) VALUES(NULL, '2009-05-22 04:47:49', '2009-05-22 04:47:49', 1, NULL, NULL)
---
  def new
    @speeddial_numbers = current_user.speeddial_numbers
    @speeddial_numbers << SpeeddialNumber.new

INSERT INTO `speeddial_numbers` (`number`, `created_at`, `updated_at`, `user_id`, `entry`, `description`) VALUES('011919885089712', '2009-05-28 05:26:37', '2009-05-28 05:26:37', 1, 113, 'Rajesh')
---
  def create
    @speeddial_number = current_user.speeddial_numbers.new(params[:speeddial_number])

    respond_to do |format|
      if @speeddial_number.save

SELECT * FROM `speeddial_numbers` WHERE (`speeddial_numbers`.user_id = 1)
SELECT count(*) AS count_all FROM `speeddial_numbers` WHERE (`speeddial_numbers`.user_id = 1)
INSERT INTO `speeddial_numbers` (`number`, `created_at`, `updated_at`, `user_id`, `entry`, `description`) VALUES(NULL, '2009-05-21 05:29:42', '2009-05-21 05:29:42', 1, NULL, NULL)
---
	def index
	  @speeddial_numbers = current_user.speeddial_numbers
		if (current_user.speeddial_numbers.size == 0)
		  @speeddial_numbers << current_user.speeddial_numbers.new

SELECT * FROM `speeddial_numbers` WHERE (`speeddial_numbers`.`id` = 1)
UPDATE `speeddial_numbers` SET `updated_at` = '2009-05-22 04:47:44', `number` = '011919885089712', `entry` = 11, `description` = 'Sweth india' WHERE `id` = 1
---
	def update
	  unless (params[:commit] == 'Delete')
	    @speeddial_number = SpeeddialNumber.find(params[:id])

      respond_to do |format|
        if @speeddial_number.update_attributes(params[:speeddial_number])