app/controllers/users_controller.rb

INSERT INTO `plans` (`name`, `price`, `renewal_period`, `created_at`, `minutes`, `updated_at`, `phones`, `description`, `recursive`) VALUES('Basic', 2.39, 1, '2009-05-26 03:43:07', 500, '2009-05-26 03:43:07', 2, 'For individual', NULL)
INSERT INTO `users` (`city`, `single_access_token`, `last_request_at`, `card_expiration`, `created_at`, `crypted_password`, `zip_code`, `billing_id`, `perishable_token`, `updated_at`, `card_number`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `address_1`, `phone_number`, `persistence_token`, `login_count`, `last_name`, `address_2`, `last_login_ip`, `login`, `last_login_at`, `email`, `first_name`, `state`, `plan_id`, `pin`) VALUES('', 'mtakZeua9elNS3rz0QO0', '2009-05-26 04:06:09', '05-2011', '2009-05-26 04:06:09', '0b04feda25355c423eafdefc8cd4c9cc6d0c44c71f08ebb1010e1d2bdc8271065db5a42c5320efdee56f85fc028dd293360cb58f2f4c8dcd2307cca3baf3cec1', '', NULL, 'cGgWJPPP4nSVpEvCZxjA', '2009-05-26 04:06:09', 'XXXX-XXXX-XXXX-1111', 0, '127.0.0.1', 'RjiPPAb22cFZEG8V2C-h', '2009-05-26 04:06:09', '', '', '01d4f56b024a3319562d20f3171388e3a96df1dfa9c4bdc7eb17ad93b7404a4b0c86d8c3ca0cf62060b6b815863e906ad113d4992518164fa05d4a4d87ac754a', 1, 'Guthikonda', '', NULL, 'ajay', NULL, 'ajay@jcomponent.com', 'Ajay kumar', '', 3, 34781794)
---
  def create
    @user = User.new(params[:user])
    @creditcard = ActiveMerchant::Billing::CreditCard.new(params[:active_merchant_billing_credit_card])

    @creditcard.first_name = @user.first_name
    @creditcard.last_name = @user.last_name
    @user.creditcard = @creditcard
    @user.plan = @plan

    if @user.save

UPDATE `users` SET `updated_at` = '2009-05-21 05:34:09', `crypted_password` = 'b2a224ff55c59f1ef01f6856c7c925c78462a45ba7a751e1b3380ff4d1b1343d76b20f19085cc21a4ddb1bf34f2de1002235b977a05559cd9050dcb9265bbe14', `last_login_at` = '2009-05-21 05:33:59', `current_login_at` = '2009-05-21 05:34:09', `password_salt` = '2ddBMefik3TgF0CSqho-', `login_count` = 6, `persistence_token` = '96fce663ba40f4d7569828df6f2357602cce001985ec08a27f36cfa01fc4e29b53f8f8fbacb1272205c8deb4e519e43c9b2bacfb22f96e81b03e2d04856ab7b3', `last_request_at` = '2009-05-21 05:34:09' WHERE `id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])

SELECT * FROM `plans` WHERE (`plans`.`name` = 'Basic') LIMIT 1
---
  def load_plan
    @plan = params[:plan]? Plan.find(params[:plan]) : Plan.find_by_name('Plus')